backend/README.tex
% Created 2025-04-22 Tue 18:19
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,margin=1in]{geometry}
\usepackage{minted}
\usemintedstyle{friendly}
\pagestyle{empty}
\usepackage{graphicx}
\usepackage{url}
\usepackage{fontspec}
\setmainfont{Liberation Serif}
\setsansfont{Liberation Sans}
\setmonofont{Liberation Mono}
\author{Tiszolczi Jácint}
\date{\today}
\title{UniPoint backend dokumentáció}
\hypersetup{
 pdfauthor={Tiszolczi Jácint},
 pdftitle={UniPoint backend dokumentáció},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Mysql Szerver}
\label{sec:org4453bc1}
\begin{itemize}
\item Szolgáltató
\begin{itemize}
\item Azure Database for MySQL flexible server
\item Config: Burstable, B1ms, 1 vCores, 2 GiB RAM, 20 storage, 360 IOPS
\item Hely: Poland Central
\end{itemize}
\item Admin login
\begin{itemize}
\item Username: uniPointAdmin
\item Password: appsettings.json-ben
\end{itemize}
\item Tűzfal
\begin{itemize}
\item Csak az Azureon lévő backend érhetné el az adatbázist, de jelenleg minden IP elérheti hogy lokálisan is lehessen futtatni a backendet.
\end{itemize}
\end{itemize}
\section{Adatbázis felépítése}
\label{sec:org9fbeab9}

Az adatbázis elkészítését az EntityFramework kezeli, tehát a model osztályokból készíti a táblákat és a kapcsolatokat. Az adatbázis MySQL alapú, ezt a Pomelo.EntityFrameworkCore.MySql NuGet package valósítja meg.
\subsection{user tábla}
\label{sec:org12ebd85}
\begin{itemize}
\item Id: PK, VARCHAR(255), not null, unique
\item UserName: LONGTEXT, not null, 1-30 hosszú
\item Email: VARCHAR(255), email validáció
\item PhoneNumber: LONGTEXT, telefonszám validáció
\item ProfilePictureUrl: VARCHAR(255), not null,
default: \texttt{"https://tiszolczijacint.blob.core.windows.net/img/63cf316b-35a1-432e-92fe-0f2d0b2029c3.jpg"}
\item CreatedAt: DATETIME(6), not null, timestamp validáció, default: létrehozás dátuma UTC
\item PasswordHash: LONGTEXT, not null, automatikus titkosítás
\item Location: VARCHAR(255)
\item IsPushNotificationsEnabled: TINYINT(1), (Entityframework bool)
\item UserSelectedLanguage: LONGTEXT, Lehetséges értékek: "magyar", "angol"
\end{itemize}

IdentityUser által létrehozott, közvetlenül nem használt
\begin{itemize}
\item AccessFailedCount: INT(11), not null
\item ConcurrencyStamp: LONGTEXT
\item EmailConfirmed: TINYINT(1), not null
\item LockoutEnabled: TINYINT(1), not null
\item LockoutEnd: DATETIME(6)
\item NormalizedEmail: LONGTEXT
\item NormalizedUserName: LONGTEXT
\item PhoneNumberConfirmed: TINYINT(1), not null
\item SecurityStamp: LONGTEXT
\item TwoFactorEnabled: TINYINT(1), not null
\end{itemize}
\subsection{services tábla}
\label{sec:org64fb5df}
\begin{itemize}
\item ServiceId: PK, INT(11), not null, unique
\item UserId: VARCHAR(255), not null, FK: user.Id, (Szolgáltató Id)
\item ServiceName: VARCHAR(255), not null
\item Price: INT(11), not null
\item Description: VARHCHAR(2000), not null
\item Address: VARCHAR(255), not null
\item Duration: INT(11)
\item CategoryId: INT, not null
\item ImageUrls: LONGTEXT (Entityframework string list)
\item ClosesAt: TIME(6)
\item OpensAt: TIME(6)
\end{itemize}
\subsection{categories tábla}
\label{sec:org822976e}
\begin{itemize}
\item CategoryId: PK, INT, not null,
default: \texttt{"https://tiszolczijacint.blob.core.windows.net/img/63cf316b-35a1-432e-92fe-0f2d0b2029c3.jpg"}
\item Name: VARCHAR(255), not null
\item IconUrl: LONGTEXT
\end{itemize}
\subsection{appointments tábla}
\label{sec:org122fb32}
\begin{itemize}
\item Id:  PK, INT(11), not null, unique
\item UserId: VARCHAR(255), FK: user.Id, (Foglaló Id)
\item ServiceId: INT(11), not null, FK: services.ServiceId
\item appointmentDate: DATETIME(6), not null, timestamp validáció
\item Status: INT(11), not null
\begin{itemize}
\item az EF kezeli, igazából enum
\item lehetséges értékei: OPEN, SCHEDULED, DONE, CANCELLED\textsubscript{BY}\textsubscript{USER}, CANCELLED\textsubscript{BY}\textsubscript{SERVICE}
\item default: OPEN
\end{itemize}
\end{itemize}
\subsection{reviews tábla}
\label{sec:orgab51bb5}
\begin{itemize}
\item ReviewId: PK, INT(11), not null, unique
\item UserId: VARCHAR(255), FK: user.Id, (Értékelő Id)
\item ServiceId: INT(11), not null, FK: services.ServiceId
\item Score: INT(11), not null, értéke 1-5
\item Description: VARHCHAR(2000), not null
\item CreatedAt: DATETIME(6), not null, timestamp validáció, default: létrehozás dátuma UTC
\end{itemize}
\subsection{EntityFramework és IdentityUser által létrehozott táblák}
\label{sec:org7e01b42}
\begin{itemize}
\item roleclaims
\begin{itemize}
\item Id:  PK, INT(11), not null, unique
\item RoleId: LONGTEXT
\item ClaimType: LONGTEXT
\item ClaimValue: LONGTEXT
\end{itemize}
\item roles
\begin{itemize}
\item Id: PK, VARCHAR(255), not null, unique
\item Name: LONGTEXT
\item NormailzedName: LONGTEXT
\item ConcurrencyStamp: LONGTEXT
\end{itemize}
\item userclaims
\begin{itemize}
\item Id:  PK, INT(11), not null, unique
\item UserId: LONGTEXT
\item ClaimType: LONGTEXT
\item ClaimValue: LONGTEXT
\end{itemize}
\item userlogins
\begin{itemize}
\item LoginProvider: PK, VARCHAR(255), not null, unique
\item ProviderKey: PK, VARCHAR(255), not null, unique
\item ProviderDisplayName: LONGTEXT
\item UserId: LONGTEXT
\end{itemize}
\item userroles
\begin{itemize}
\item UserId: PK, VARCHAR(255), not null, unique
\item RoleId: PK, VARCHAR(255), not null, unique
\end{itemize}
\item usertokens
\begin{itemize}
\item UserId: PK, VARCHAR(255), not null, unique
\item LoginProvider: PK, VARCHAR(255), not null, unique
\item Name: PK, VARCHAR(255), not null, unique
\item Value: LONGTEXT
\end{itemize}
\item \_\textsubscript{efmigrationhistory}
\begin{itemize}
\item MigrationId: PK, VARCHAR(150), not null, unique
\item ProductVersion: VARCHAR(32), not null
\end{itemize}
\end{itemize}
\section{Végpontok}
\label{sec:org5d440d6}
Swagger: [[\url{https://unipoint-b6h6h4cubncmafhh.polandcentral-01.azurewebsites.net/swagger/index.html}]]
\begin{itemize}
\item A hitelesítéshez a bejelentkezéskor kapott JWT tokent be kell másolni az Authorize részbe.
\end{itemize}
\subsection{Auth}
\label{sec:org48d3d36}
\subsubsection{Register}
\label{sec:orga3b2380}
\begin{itemize}
\item url: /api/Auth/register
\item POST request:
\end{itemize}
\begin{verbatim}
{
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Gyor",
  "password": "Jeno123",
  "role": "User"
}
\end{verbatim}
\begin{itemize}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI1YmM1MDk3Mi01M2RmLTQ1NmEtOGU2MC1jMzcyMjJhZDEwM2QiLCJlbWFpbCI6Implbm9AZXhhbXBsZS5jb20iLCJ1bmlxdWVfbmFtZSI6Implbm8iLCJsb2NhdGlvbiI6Ikd5b3IiLCJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL3dzLzIwMDgvMDYvaWRlbnRpdHkvY2xhaW1zL3JvbGUiOiJVc2VyIiwiZXhwIjoxNzQ1OTE3MjUyLCJpc3MiOiJodHRwczovL3VuaXBvaW50LWI2aDZoNGN1Ym5jbWFmaGgucG9sYW5kY2VudHJhbC0wMS5henVyZXdlYnNpdGVzLm5ldCIsImF1ZCI6Imh0dHBzOi8vdW5pcG9pbnQtYjZoNmg0Y3VibmNtYWZoaC5wb2xhbmRjZW50cmFsLTAxLmF6dXJld2Vic2l0ZXMubmV0In0.pSL_OrSHcPK8fZqlmHTtLBclXwlL4o7wyKBwgEkjIho",
  "message": "User registered successfully!",
  "userId": "5bc50972-53df-456a-8e60-c37222ad103d",
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Gyor"
}
\end{verbatim}
