backend/README.tex
\subsubsection{Login}
\label{sec:org05e8901}
\begin{itemize}
\item url: /api/Auth/login
\item POST request:
\end{itemize}
\begin{verbatim}
{
  "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI1YmM1MDk3Mi01M2RmLTQ1NmEtOGU2MC1jMzcyMjJhZDEwM2QiLCJlbWFpbCI6Implbm9AZXhhbXBsZS5jb20iLCJ1bmlxdWVfbmFtZSI6Implbm8iLCJsb2NhdGlvbiI6Ikd5b3IiLCJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL3dzLzIwMDgvMDYvaWRlbnRpdHkvY2xhaW1zL3JvbGUiOiJVc2VyIiwiZXhwIjoxNzQ1OTE3MjUyLCJpc3MiOiJodHRwczovL3VuaXBvaW50LWI2aDZoNGN1Ym5jbWFmaGgucG9sYW5kY2VudHJhbC0wMS5henVyZXdlYnNpdGVzLm5ldCIsImF1ZCI6Imh0dHBzOi8vdW5pcG9pbnQtYjZoNmg0Y3VibmNtYWZoaC5wb2xhbmRjZW50cmFsLTAxLmF6dXJld2Vic2l0ZXMubmV0In0.pSL_OrSHcPK8fZqlmHTtLBclXwlL4o7wyKBwgEkjIho",
  "message": "Login successful",
  "userId": "5bc50972-53df-456a-8e60-c37222ad103d",
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Gyor"
}
\end{verbatim}
\begin{itemize}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJiZjhjYjNhMC00MWVjLTRmYjctOGVhYi1lOWZkYTFiMzVkMjQiLCJlbWFpbCI6Implbm9AZXhhbXBsZS5jb20iLCJ1bmlxdWVfbmFtZSI6Implbm8iLCJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL3dzLzIwMDgvMDYvaWRlbnRpdHkvY2xhaW1zL3JvbGUiOiJVc2VyIiwiZXhwIjoxNzQxMzQ5MTgxLCJpc3MiOiJodHRwczovL2xvY2FsaG9zdDo1MDAxIiwiYXVkIjoiaHR0cHM6Ly9sb2NhbGhvc3Q6NTAwMSJ9.rc1SfKdnQCIqoZpdTbDq-hj7xLPmzmKtbfql92G_1wE",
  "message": "Login successful",
  "userId": "bf8cb3a0-41ec-4fb7-8eab-e9fda1b35d24"
}
\end{verbatim}
\subsubsection{Logout}
\label{sec:org2e06d77}
\begin{itemize}
\item url: /api/Auth/logout
\item POST request
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "message": "Logout successful."
}
\end{verbatim}
\subsection{User}
\label{sec:org20b577b}
\begin{itemize}
\item Roles: User, Provider
\end{itemize}
\subsubsection{Get Users}
\label{sec:orga825bfc}
\begin{itemize}
\item url: /api/User
\item GET request
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
[
  {
    "userName": "HabosBabos",
    "email": "habos@babos.com",
    "location": "habos",
    "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/63cf316b-35a1-432e-92fe-0f2d0b2029c3.jpg"
  },
  {
    "userName": "KisJeno",
    "email": "kisjeno@example.com",
    "location": "Budapest Váci út 93",
    "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/20055bcd-ed28-4e8c-acbe-9be90e14f4d3.jpg"
  },
 ...
]
\end{verbatim}
\subsubsection{Get User by ID}
\label{sec:orgaa7b140}
\begin{itemize}
\item url: /api/User/\{id\}
\item GET request (/api/User/5bc50972-53df-456a-8e60-c37222ad103d)
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Gyor",
  "role": "User",
  "createdAt": "2025-04-22T09:00:52.015807"
}
\end{verbatim}
\subsubsection{Update User}
\label{sec:org606cd06}
\begin{itemize}
\item Role: Current User
\item url: /api/User/\{id\}
\item PUT request (/api/User/5bc50972-53df-456a-8e60-c37222ad103d)
\end{itemize}
\begin{verbatim}
{
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Budapest",
  "isPushNotificationsEnabled": true,
  "userSelectedLanguage": "magyar"
}
\end{verbatim}
\begin{itemize}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Budapest",
  "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/20055bcd-ed28-4e8c-acbe-9be90e14f4d3.jpg"
}
\end{verbatim}
\subsubsection{Change User Profile Picture}
\label{sec:orgd948ea8}
\begin{itemize}
\item Role: Current User
\item url: /api/User/\{id\}/upload-profile-picture
\item POST request (/api/User/5bc50972-53df-456a-8e60-c37222ad103d/upload-profile-picture)
\end{itemize}
\begin{verbatim}
{
  "headers": {
    "accept": "*/*",
    "Authorization": "Bearer [token]",
    "Content-Type": "multipart/form-data"
  },
  "body": {
    "file": {
      "value": "@pfp.jpg",
      "options": {
        "filename": "pfp.jpg",
        "contentType": "image/jpeg"
      }
    }
  }
}
\end{verbatim}
\begin{itemize}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "userName": "jeno",
  "email": "jeno@example.com",
  "location": "Budapest",
  "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/bb405441-c3af-4c21-9757-7ed00a7b40f1.jpg"
}
\end{verbatim}
\subsubsection{Delete User}
\label{sec:org59017c7}
\begin{itemize}
\item Role: Current User
\item url: /api/User/\{id\}
\item DELETE request (\emph{api/User/5bc50972-53df-456a-8e60-c37222ad103d}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  message: User deleted successfully.
}
\end{verbatim}
\subsection{Service}
\label{sec:orga58e9dd}
\subsubsection{Get Services}
\label{sec:org1448e36}
\begin{itemize}
\item url: /api/Service
\item GET request
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
[
  {
    "serviceId": 1,
    "userId": "5b02dd18-efa6-49e4-bb14-72956dfd92fb",
    "provider": {
      "userName": "NagyFerenc",
      "email": "nagyferenc@example.com",
      "location": "Győr Budai Út 23",
      "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/ab68b3c7-6e09-4a8b-a9c0-f587cc95d214.jpg"
    },
    "category": {
      "categoryId": 1,
      "name": "Hajvágás",
      "iconUrl": "https://tiszolczijacint.blob.core.windows.net/img/7addb194-b06e-492f-8be0-47a1f03de298.png"
    },
    "categoryId": 1,
    "serviceName": "Férfi hajvágás",
    "price": 5000,
    "description": "Donec pretium posuere tellus.  Nullam rutrum.  Praesent augue.  Aliquam erat volutpat.  Nunc eleifend leo vitae magna.  In id erat non orci commodo lobortis.  Proin neque massa, cursus ut, gravida ut, lobortis eget, lacus.  Sed diam.  Praesent fermentum tempor tellus.  Nullam tempus.  Mauris ac felis vel velit tristique imperdiet.  Donec at pede.  Etiam vel neque nec dui dignissim bibendum.  Vivamus id enim.  Phasellus neque orci, porta a, aliquet quis, semper a, massa.  Phasellus purus.  Pellentesque tristique imperdiet tortor.  Nam euismod tellus id erat.",
    "address": "Győr Budai Út 83",
    "duration": 20,
    "openingHours": 0,
    "imageUrls": [
      "https://tiszolczijacint.blob.core.windows.net/img/cda0f295-d78b-40f0-a5cc-d2b224b5cc46.jpg",
      "https://tiszolczijacint.blob.core.windows.net/img/3edda464-8ae6-481d-ba57-7b271cce2ec4.jpg"
    ]
  },
  {
    "serviceId": 2,
    "userId": "35a3407f-5d3f-4715-a6b6-51f154c40511",
    "provider": {
      "userName": "KisJeno",
      "email": "kisjeno@example.com",
      "location": "Budapest Váci út 93",
      "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/20055bcd-ed28-4e8c-acbe-9be90e14f4d3.jpg"
    },
    "category": {
      "categoryId": 2,
      "name": "Szerelés",
      "iconUrl": "https://tiszolczijacint.blob.core.windows.net/img/ef1431cf-2236-4214-b261-46b83a4fcc9a.png"
    },
    "categoryId": 2,
    "serviceName": "Mobiltelefon szerelés",
    "price": 20000,
    "description": "Donec pretium posuere tellus.  Nullam rutrum.  Praesent augue.  Aliquam erat volutpat.  Nunc eleifend leo vitae magna.  In id erat non orci commodo lobortis.  Proin neque massa, cursus ut, gravida ut, lobortis eget, lacus.  Sed diam.  Praesent fermentum tempor tellus.  Nullam tempus.  Mauris ac felis vel velit tristique imperdiet.  Donec at pede.  Etiam vel neque nec dui dignissim bibendum.  Vivamus id enim.  Phasellus neque orci, porta a, aliquet quis, semper a, massa.  Phasellus purus.  Pellentesque tristique imperdiet tortor.  Nam euismod tellus id erat.",
    "address": "Budapest Váci út 93",
    "duration": 100,
    "openingHours": 0,
    "imageUrls": [
      "https://tiszolczijacint.blob.core.windows.net/img/b351255a-1ad5-48dd-b6ef-8c15a1644b81.jpg",
      "https://tiszolczijacint.blob.core.windows.net/img/f1771efb-a476-4e48-a52f-f8c5c211669a.jpg"
    ]
  },
  ...
]
\end{verbatim}
