backend/README.tex
\subsubsection{Get Service by ID}
\label{sec:org522bd57}
\begin{itemize}
\item url: /api/Service/\{id\}
\item GET request (/api/Service/1)
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "serviceId": 1,
  "userId": "5b02dd18-efa6-49e4-bb14-72956dfd92fb",
  "provider": {
    "userName": "NagyFerenc",
    "email": "nagyferenc@example.com",
    "location": "Győr Budai Út 23",
    "profilePictureUrl": "https://tiszolczijacint.blob.core.windows.net/img/ab68b3c7-6e09-4a8b-a9c0-f587cc95d214.jpg"
  },
  "category": {
    "categoryId": 1,
    "name": "Hajvágás",
    "iconUrl": "https://tiszolczijacint.blob.core.windows.net/img/7addb194-b06e-492f-8be0-47a1f03de298.png"
  },
  "categoryId": 1,
  "serviceName": "Férfi hajvágás",
  "price": 5000,
  "description": "Donec pretium posuere tellus.  Nullam rutrum.  Praesent augue.  Aliquam erat volutpat.  Nunc eleifend leo vitae magna.  In id erat non orci commodo lobortis.  Proin neque massa, cursus ut, gravida ut, lobortis eget, lacus.  Sed diam.  Praesent fermentum tempor tellus.  Nullam tempus.  Mauris ac felis vel velit tristique imperdiet.  Donec at pede.  Etiam vel neque nec dui dignissim bibendum.  Vivamus id enim.  Phasellus neque orci, porta a, aliquet quis, semper a, massa.  Phasellus purus.  Pellentesque tristique imperdiet tortor.  Nam euismod tellus id erat.",
  "address": "Győr Budai Út 83",
  "duration": 20,
  "openingHours": 0,
  "imageUrls": [
    "https://tiszolczijacint.blob.core.windows.net/img/cda0f295-d78b-40f0-a5cc-d2b224b5cc46.jpg",
    "https://tiszolczijacint.blob.core.windows.net/img/3edda464-8ae6-481d-ba57-7b271cce2ec4.jpg"
  ]
}
\end{verbatim}
\subsubsection{Post new Service}
\label{sec:orga03e094}
\begin{itemize}
\item Role: Provider
\item url: /api/Service
\item POST request:
\end{itemize}
\begin{verbatim}
{
  "userId": "677e7b94-d191-4db7-8af8-ab22b32ff2ed",
  "categoryId": 2,
  "serviceName": "Autó szerelés",
  "price": 30000,
  "description": "Praesent a eros sit amet eros hendrerit semper in quis purus. Aenean sagittis felis vitae iaculis fermentum. Etiam tempus imperdiet mollis. Vivamus pretium mi non nibh iaculis venenatis. Donec pellentesque, felis a pharetra ultricies, ante enim consectetur lectus, nec vestibulum nisi augue sit amet dolor. Aenean vitae tempor mauris. Cras volutpat hendrerit neque id ultrices. ",
  "address": "Gyor Szent Istvan ut 95",
  "duration": 120,
  "opensAt": "08:00:00",
  "closesAt": "17:00:00"
}
#+end_src json
- Response:
  - StatusCode: 201
#+begin_src json :eval no-export :wrap breaklines
{
  "serviceId": 3,
  "userId": "677e7b94-d191-4db7-8af8-ab22b32ff2ed",
  "provider": null,
  "category": null,
  "categoryId": 2,
  "serviceName": "Autó szerelés",
  "price": 30000,
  "description": "Praesent a eros sit amet eros hendrerit semper in quis purus. Aenean sagittis felis vitae iaculis fermentum. Etiam tempus imperdiet mollis. Vivamus pretium mi non nibh iaculis venenatis. Donec pellentesque, felis a pharetra ultricies, ante enim consectetur lectus, nec vestibulum nisi augue sit amet dolor. Aenean vitae tempor mauris. Cras volutpat hendrerit neque id ultrices. ",
  "address": "Gyor Szent Istvan ut 95",
  "duration": 120,
  "opensAt": "08:00:00",
  "closesAt": "17:00:00",
  "imageUrls": null
}
\end{verbatim}
\subsubsection{Update Service}
\label{sec:org3c76823}
\begin{itemize}
\item Role: Provider of service
\item url: /api/Service/\{id\}
\item PUT request (/api/Service/3)
\end{itemize}
\begin{verbatim}
{
  "serviceId": 3,
  "userId": "677e7b94-d191-4db7-8af8-ab22b32ff2ed",
  "serviceName": "Autó szerelés",
  "price": 40000,
  "description": "Praesent a eros sit amet eros hendrerit semper in quis purus. Aenean sagittis felis vitae iaculis fermentum. Etiam tempus imperdiet mollis. Vivamus pretium mi non nibh iaculis venenatis. Donec pellentesque, felis a pharetra ultricies, ante enim consectetur lectus, nec vestibulum nisi augue sit amet dolor. Aenean vitae tempor mauris. Cras volutpat hendrerit neque id ultrices. ",
  "address": "Gyor Szent Istvan ut 95",
  "duration": 120,
  "opensAt": "08:00:00",
  "closesAt": "17:30:00"
}
\end{verbatim}
\begin{itemize}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "serviceId": 3,
  "userId": "677e7b94-d191-4db7-8af8-ab22b32ff2ed",
  "provider": null,
  "category": null,
  "categoryId": 2,
  "serviceName": "Autó szerelés",
  "price": 40000,
  "description": "Praesent a eros sit amet eros hendrerit semper in quis purus. Aenean sagittis felis vitae iaculis fermentum. Etiam tempus imperdiet mollis. Vivamus pretium mi non nibh iaculis venenatis. Donec pellentesque, felis a pharetra ultricies, ante enim consectetur lectus, nec vestibulum nisi augue sit amet dolor. Aenean vitae tempor mauris. Cras volutpat hendrerit neque id ultrices. ",
  "address": "Gyor Szent Istvan ut 95",
  "duration": 120,
  "opensAt": "08:00:00",
  "closesAt": "17:30:00",
  "imageUrls": null
}
\end{verbatim}
\subsubsection{Add Images to Service}
\label{sec:org15c0562}
\begin{itemize}
\item Role: Provider of service
\item url: /api/Service/\{id\}/upload-service-picture
\item POST request (/api/Service/3/upload-service-picture)
\end{itemize}
\begin{verbatim}
{
  "headers": {
    "accept": "*/*",
    "Authorization": "Bearer [token]",
    "Content-Type": "multipart/form-data"
  },
  "body": {
    "files": [
      {
        "value": "@car1.jpg",
        "options": {
          "filename": "car1.jpg",
          "contentType": "image/jpeg"
        }
      },
      {
        "value": "@car2.jpg",
        "options": {
          "filename": "car2.jpg",
          "contentType": "image/jpeg"
        }
      },
      {
        "value": "@car3.jpg",
        "options": {
          "filename": "car3.jpg",
          "contentType": "image/jpeg"
        }
      }
    ]
  }
}

\end{verbatim}
\begin{itemize}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\begin{verbatim}
{
  "serviceId": 3,
  "userId": "677e7b94-d191-4db7-8af8-ab22b32ff2ed",
  "provider": null,
  "category": null,
  "categoryId": 2,
  "serviceName": "Autó szerelés",
  "price": 40000,
  "description": "Praesent a eros sit amet eros hendrerit semper in quis purus. Aenean sagittis felis vitae iaculis fermentum. Etiam tempus imperdiet mollis. Vivamus pretium mi non nibh iaculis venenatis. Donec pellentesque, felis a pharetra ultricies, ante enim consectetur lectus, nec vestibulum nisi augue sit amet dolor. Aenean vitae tempor mauris. Cras volutpat hendrerit neque id ultrices. ",
  "address": "Gyor Szent Istvan ut 95",
  "duration": 120,
  "opensAt": "08:00:00",
  "closesAt": "17:00:00",
  "imageUrls": [
    "https://tiszolczijacint.blob.core.windows.net/img/2136ae16-7f2d-47c0-b30a-737c3c255500.jpg",
    "https://tiszolczijacint.blob.core.windows.net/img/6e143f27-6257-4df2-8471-887d9a92ec9e.jpg",
    "https://tiszolczijacint.blob.core.windows.net/img/1f148c9b-4341-494b-8219-56046bec830d.jpg"
  ]
}
\end{verbatim}
\subsubsection{Delete Service}
\label{sec:org2eb94b8}
\begin{itemize}
\item Role: Provider of service
\item url: /api/Service/\{id\}
\item DELETE request (\emph{api/Service/3}
\item Response:
\begin{itemize}
\item StatusCode: 200
\end{itemize}
\end{itemize}
\end{document}
